#include <stdio.h>

 int main() {

    printf("+-------------------+-------+-------+-------+\n");                     // แสดงหัวตาราง
    int i = 1, j = 2, k;                                                           // ประกาศตัวแปร int   
    printf("|        นิพจน์       | i = %d | j = %d | k = %d |\n", i , j , k);       // แสดงค่าตัวแปรทั้งหมด
    printf("+-------------------+-------+-------+-------+\n");                     // แสดงเส้นแบ่งตาราง
    k = i + j;                                                                     // คำนวณค่า k = i + j 
    printf("| k = i + j         |%7d|%7d|%7d|\n",i, j, k);                         // แสดงผลการคำนวณ ของ k = i + j            
    printf("|-------------------|-------|-------|-------|\n");                     // แสดงเส้นแบ่งตาราง
    i = i + ( k * j );                                                             // คำนวณค่า i = i + (k * j)  
    printf("| i = i + ( k * j ) |%7d|%7d|%7d|\n",i, j, k);                         // แสดงผลการคำนวณ ของ i = i + (k * j)  
    printf("|-------------------|-------|-------|-------|\n");                     // แสดงเส้นแบ่งตาราง
    j = i/2;                                                                       // คำนวณค่า j = i / 2                                 
    printf("| j = i / 2         |%7d|%7d|%7d|\n",i, j, k);                         // แสดงผลการคำนวณ ของ j = i / 2       
    printf("|-------------------|-------|-------|-------|\n");                     // แสดงเส้นแบ่งตาราง
    k = i % 2;                                                                     // คำนวณค่า k = i % 2                           
    printf("| k = i %% 2         |%7d|%7d|%7d|\n",i, j, k);                        // แสดงผลการคำนวณ ของ k = i % 2 
    printf("|-------------------|-------|-------|-------|\n");                     // แสดงเส้นแบ่งตาราง
    i = (j + k) * 3;                                                               // คำนวณค่า i = (j + k) * 3                          
    printf("| i = ( j + k ) *3  |%7d|%7d|%7d|\n",i, j, k);                         // แสดงผลการคำนวณ ของ i = (j + k) * 3 
    printf("+-------------------+-------+-------+-------+\n");                     // แสดงเส้นล่างสุดของตาราง 

    return 0;                    // คืนค่า 0 โปรแกรมทำงานเสร็จสิ้น
 }